In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,3,5, np.nan, 6, 8])
dates = pd.date_range("20130101", periods=6)

In [3]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [5]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
from TodoDAO import TodoDAO
dao = TodoDAO('todos_db.db')
todos = dao.findAll()
df_todos = pd.DataFrame(todos)
df_todos

        id                                            title  completed
0     2001           Karlsson Brothers (BrÃ¶derna Karlsson)          1
1     2002                                     Book of Love          1
2     2006  Reel Bad Arabs: How Hollywood Vilifies a People          0
3     2007                                         30 Beats          0
4     2008            War of the Wildcats (In Old Oklahoma)          1
...    ...                                              ...        ...
1990  3996                           Blue Spring (Aoi haru)          0
1991  3997                                  Sun Don t Shine          1
1992  3998                                      Tribulation          1
1993  3999            Xiu Xiu: The Sent-Down Girl (Tian yu)          0
1994  4000                 Stuff and Dough (Marfa si banii)          0

[1995 rows x 3 columns]